apache/nuttx/arch/arm/src/kinetis/chip/kinetis_usbhs.h
/********************************************************************************************************************
 * arch/arm/src/kinetis/chip/kinetis_usbhs.h
 *
 *   Copyright (C) 2018 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *   Author: Ramtin Amin <ramtin@lambdaconcept.com>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************************************************* */

#ifndef __ARCH_ARM_SRC_KINETIS_CHIP_KINETIS_USBHS_H
#define __ARCH_ARM_SRC_KINETIS_CHIP_KINETIS_USBHS_H

/********************************************************************************************************************
 * Included Files
 ******************************************************************************************************************* */

#include <nuttx/config.h>
#include "chip.h"

/********************************************************************************************************************
 * Pre-processor Definitions
 ******************************************************************************************************************* */

/* Register Offsets ************************************************************************************************ */

#define KINETIS_USBHS_ID_OFFSET                           0x0000  /* Identification Register */
#define KINETIS_USBHS_HWGENERAL_OFFSET                    0x0004  /* General Hardware Parameters */
#define KINETIS_USBHS_HWHOST_OFFSET                       0x0008  /* Host Hardware Parameters */
#define KINETIS_USBHS_HWDEVICE_OFFSET                     0x000c  /* Device Hardware Parameters */
#define KINETIS_USBHS_HWTXBUF_OFFSET                      0x0010  /* TX Buffer Hardware Parameters */
#define KINETIS_USBHS_HWRXBUF_OFFSET                      0x0014  /* RX Buffer Hardware Parameters */
#define KINETIS_USBHS_GPTIMER0LD_OFFSET                   0x0080  /* General Purpose Timer 0 Load */
#define KINETIS_USBHS_GPTIMER0CTL_OFFSET                  0x0084  /* General Purpose Timer 0 Control */
#define KINETIS_USBHS_GPTIMER1LD_OFFSET                   0x0088  /* General Purpose Timer 1 Load */
#define KINETIS_USBHS_GPTIMER1CTL_OFFSET                  0x008c  /* General Purpose Timer 1 Control */
#define KINETIS_USBHS_HCIVERSION_OFFSET                   0x0100  /* Host Interface Version Number */
#define KINETIS_USBHS_CAPLENGTH_OFFSET                    0x0103  /* Capability Register Length */
#define KINETIS_USBHS_HCSPARAMS_OFFSET                    0x0104  /* Host Structural Parameters */
#define KINETIS_USBHS_HCCPARAMS_OFFSET                    0x0108  /* Host Capability Parameters */
#define KINETIS_USBHS_DCIVERSION_OFFSET                   0x0122  /* Device Interface Version Number */
#define KINETIS_USBHS_DCCPARAMS_OFFSET                    0x0124  /* Device Capability Parameters */
#define KINETIS_USBHS_USBCMD_OFFSET                       0x0140  /* USB Command */
#define KINETIS_USBHS_USBSTS_OFFSET                       0x0144  /* USB Status */
#define KINETIS_USBHS_USBINTR_OFFSET                      0x0148  /* USB Interrupt Enable */
#define KINETIS_USBHS_FRINDEX_OFFSET                      0x014c  /* USB Frame Index */
#define KINETIS_USBHS_PERIODICLISTBASE_OFFSET             0x0154  /* Periodic Frame List Base Address */
#define KINETIS_USBHS_DEVICEADDR_OFFSET                   0x0154  /* Device Address */
#define KINETIS_USBHS_ASYNCLISTADDR_OFFSET                0x0158  /* Current Asynchronous List Address */
#define KINETIS_USBHS_EPLISTADDR_OFFSET                   0x0158  /* Address at Endpoint List */
#define KINETIS_USBHS_TTCTRL_OFFSET                       0x015c  /* Host TT Asynchronous Buffer Control */
#define KINETIS_USBHS_BURSTSIZE_OFFSET                    0x0160  /* Master Interface Data Burst Size */
#define KINETIS_USBHS_TXFILLTUNING_OFFSET                 0x0164  /* Host Transmit FIFO Tuning Control */
#define KINETIS_USBHS_CONFIGFLAG_OFFSET                   0x0180  /* Configure Flag Register */
#define KINETIS_USBHS_PORTSC1_OFFSET                      0x0184  /* Port Status/Control */
#define KINETIS_USBHS_OTGSC_OFFSET                        0x01a4  /* On-The-Go Status and Control */
#define KINETIS_USBHS_MODE_OFFSET                         0x01a8  /* USB Mode Register */
#define KINETIS_USBHS_EPSETUPSR_OFFSET                    0x01ac  /* Endpoint Setup Status Register */
#define KINETIS_USBHS_EPPRIME_OFFSET                      0x01b0  /* Endpoint Initialization */
#define KINETIS_USBHS_EPFLUSH_OFFSET                      0x01b4  /* Endpoint De-initialize */
#define KINETIS_USBHS_EPSR_OFFSET                         0x01b8  /* Endpoint Status Register */
#define KINETIS_USBHS_EPCOMPLETE_OFFSET                   0x01bc  /* Endpoint Complete */
#define KINETIS_USBHS_EPCR0_OFFSET                        0x01c0  /* Endpoint Control Register 0 */
#define KINETIS_USBHS_EPCR1_OFFSET                        0x01c4  /* Endpoint Control Register 1 */
#define KINETIS_USBHS_EPCR2_OFFSET                        0x01c8  /* Endpoint Control Register 2 */
#define KINETIS_USBHS_EPCR3_OFFSET                        0x01cc  /* Endpoint Control Register 3 */
#define KINETIS_USBHS_EPCR4_OFFSET                        0x01d0  /* Endpoint Control Register 4 */
#define KINETIS_USBHS_EPCR5_OFFSET                        0x01d4  /* Endpoint Control Register 5 */
#define KINETIS_USBHS_EPCR6_OFFSET                        0x01d8  /* Endpoint Control Register 6 */
#define KINETIS_USBHS_EPCR7_OFFSET                        0x01dc  /* Endpoint Control Register 7 */
#define KINETIS_USBHS_USBGENCTRL_OFFSET                   0x0200  /* USB General Control Register */

#define KINETIS_USBHSPHY_PWD_OFFSET                       0x0000  /* USB PHY Power-Down Register */
#define KINETIS_USBHSPHY_PWD_SET_OFFSET                   0x0004  /* USB PHY Power-Down Register */
#define KINETIS_USBHSPHY_PWD_CLR_OFFSET                   0x0008  /* USB PHY Power-Down Register */
#define KINETIS_USBHSPHY_PWD_TOG_OFFSET                   0x000c  /* USB PHY Power-Down Register */
#define KINETIS_USBHSPHY_TX_OFFSET                        0x0010  /* USB PHY Transmitter Control Register */
#define KINETIS_USBHSPHY_TX_SET_OFFSET                    0x0014  /* USB PHY Transmitter Control Register */
#define KINETIS_USBHSPHY_TX_CLR_OFFSET                    0x0018  /* USB PHY Transmitter Control Register */
#define KINETIS_USBHSPHY_TX_TOG_OFFSET                    0x001c  /* USB PHY Transmitter Control Register */
#define KINETIS_USBHSPHY_RX_OFFSET                        0x0020  /* USB PHY Receiver Control Register */
#define KINETIS_USBHSPHY_RX_SET_OFFSET                    0x0024  /* USB PHY Receiver Control Register */
#define KINETIS_USBHSPHY_RX_CLR_OFFSET                    0x0028  /* USB PHY Receiver Control Register */
#define KINETIS_USBHSPHY_RX_TOG_OFFSET                    0x002c  /* USB PHY Receiver Control Register */
#define KINETIS_USBHSPHY_CTRL_OFFSET                      0x0030  /* USB PHY General Control Register */
#define KINETIS_USBHSPHY_CTRL_SET_OFFSET                  0x0034  /* USB PHY General Control Register */
#define KINETIS_USBHSPHY_CTRL_CLR_OFFSET                  0x0038  /* USB PHY General Control Register */
#define KINETIS_USBHSPHY_CTRL_TOG_OFFSET                  0x003c  /* USB PHY General Control Register */
#define KINETIS_USBHSPHY_STATUS_OFFSET                    0x0040  /* USB PHY Status Register */
#define KINETIS_USBHSPHY_DEBUG_SET_OFFSET                 0x0054  /* USB PHY Debug Register */
#define KINETIS_USBHSPHY_DEBUG_CLR_OFFSET                 0x0058  /* USB PHY Debug Register */
#define KINETIS_USBHSPHY_DEBUG_TOG_OFFSET                 0x005c  /* USB PHY Debug Register */
#define KINETIS_USBHSPHY_DEBUG0_STATUS_OFFSET             0x0060  /* UTMI Debug Status Register 0 */
#define KINETIS_USBHSPHY_DEBUG1_OFFSET                    0x0070  /* UTMI Debug Status Register 1 */
#define KINETIS_USBHSPHY_DEBUG1_SET_OFFSET                0x0074  /* UTMI Debug Status Register 1 */
#define KINETIS_USBHSPHY_DEBUG1_CLR_OFFSET                0x0078  /* UTMI Debug Status Register 1 */
#define KINETIS_USBHSPHY_DEBUG1_TOG_OFFSET                0x007c  /* UTMI Debug Status Register 1 */
#define KINETIS_USBHSPHY_VERSION_OFFSET                   0x0080  /* UTMI RTL Version */
#define KINETIS_USBHSPHY_PLL_SIC_OFFSET                   0x00a0  /* USB PHY PLL Control/Status Register */
#define KINETIS_USBHSPHY_PLL_SIC_SET_OFFSET               0x00a4  /* USB PHY PLL Control/Status Register */
#define KINETIS_USBHSPHY_PLL_SIC_CLR_OFFSET               0x00a8  /* USB PHY PLL Control/Status Register */
#define KINETIS_USBHSPHY_PLL_SIC_TOG_OFFSET               0x00ac  /* USB PHY PLL Control/Status Register */
#define KINETIS_USBHSPHY_USB1_VBUS_DETECT_OFFSET          0x00c0  /* USB PHY VBUS Detect Control Register */
#define KINETIS_USBHSPHY_USB1_VBUS_DETECT_SET_OFFSET      0x00c4  /* USB PHY VBUS Detect Control Register */
#define KINETIS_USBHSPHY_USB1_VBUS_DETECT_CLR_OFFSET      0x00c8  /* USB PHY VBUS Detect Control Register */
#define KINETIS_USBHSPHY_USB1_VBUS_DETECT_TOG_OFFSET      0x00cc  /* USB PHY VBUS Detect Control Register */
#define KINETIS_USBHSPHY_USB1_VBUS_DET_STAT_OFFSET        0x00d0  /* USB PHY VBUS Detector Status Register */
#define KINETIS_USBHSPHY_USB1_CHRG_DET_STAT_OFFSET        0x00f0  /* USB PHY Charger Detect Status Register */
#define KINETIS_USBHSPHY_ANACTRL_OFFSET                   0x0100  /* USB PHY Analog Control Register */
#define KINETIS_USBHSPHY_ANACTRL_SET_OFFSET               0x0104  /* USB PHY Analog Control Register */
#define KINETIS_USBHSPHY_ANACTRL_CLR_OFFSET               0x0108  /* USB PHY Analog Control Register */
#define KINETIS_USBHSPHY_ANACTRL_TOG_OFFSET               0x010c  /* USB PHY Analog Control Register */
#define KINETIS_USBHSPHY_USB1_LOOPBACK_OFFSET             0x0110  /* USB PHY Loopback Control/Status Register */
#define KINETIS_USBHSPHY_USB1_LOOPBACK_SET_OFFSET         0x0114  /* USB PHY Loopback Control/Status Register */
#define KINETIS_USBHSPHY_USB1_LOOPBACK_CLR_OFFSET         0x0118  /* USB PHY Loopback Control/Status Register */
#define KINETIS_USBHSPHY_USB1_LOOPBACK_TOG_OFFSET         0x011c  /* USB PHY Loopback Control/Status Register */
#define KINETIS_USBHSPHY_USB1_LOOPBACK_HSFSCNT_OFFSET     0x0120  /* USB PHY Loopback Packet Number Select Register */
#define KINETIS_USBHSPHY_USB1_LOOPBACK_HSFSCNT_SET_OFFSET 0x0124  /* USB PHY Loopback Packet Number Select Register */
#define KINETIS_USBHSPHY_USB1_LOOPBACK_HSFSCNT_CLR_OFFSET 0x0128  /* USB PHY Loopback Packet Number Select Register */
#define KINETIS_USBHSPHY_USB1_LOOPBACK_HSFSCNT_TOG_OFFSET 0x012c  /* USB PHY Loopback Packet Number Select Register */
#define KINETIS_USBHSPHY_TRIM_OVERRIDE_EN_OFFSET          0x0130  /* USB PHY Trim Override Enable Register */
#define KINETIS_USBHSPHY_TRIM_OVERRIDE_EN_SET_OFFSET      0x0134  /* USB PHY Trim Override Enable Register */
#define KINETIS_USBHSPHY_TRIM_OVERRIDE_EN_CLR_OFFSET      0x0138  /* USB PHY Trim Override Enable Register */
#define KINETIS_USBHSPHY_TRIM_OVERRIDE_EN_TOG_OFFSET      0x013c  /* USB PHY Trim Override Enable Register */

#define KINETIS_USBHSDCD_CONTROL_OFFSET                   0x0000  /* Control register */
#define KINETIS_USBHSDCD_CLOCK_OFFSET                     0x0004  /* Clock register */
#define KINETIS_USBHSDCD_STATUS_OFFSET                    0x0008  /* Status register */
#define KINETIS_USBHSDCD_SIGNAL_OVERRIDE_OFFSET           0x000c  /* Signal Override Register */
#define KINETIS_USBHSDCD_TIMER0_OFFSET                    0x0010  /* TIMER0 register */
#define KINETIS_USBHSDCD_TIMER1_OFFSET                    0x0014  /* TIMER1 register */
#define KINETIS_USBHSDCD_TIMER2_BC11_OFFSET               0x0018  /*  TIMER2_BC11 register */
#define KINETIS_USBHSDCD_TIMER2_BC12_OFFSET               0x001c  /* TIMER2_BC12 register */

