apache/nuttx/arch/arm/src/kinetis/chip/kinetis_usbhs.h
/* Register Addresses ********************************************************************************************** */

#define KINETIS_USBHS_ID                                  (KINETIS_USBHS_BASE + KINETIS_USBHS_ID_OFFSET)
#define KINETIS_USBHS_HWGENERAL                           (KINETIS_USBHS_BASE + KINETIS_USBHS_HWGENERAL_OFFSET)
#define KINETIS_USBHS_HWHOST                              (KINETIS_USBHS_BASE + KINETIS_USBHS_HWHOST_OFFSET)
#define KINETIS_USBHS_HWDEVICE                            (KINETIS_USBHS_BASE + KINETIS_USBHS_HWDEVICE_OFFSET)
#define KINETIS_USBHS_HWTXBUF                             (KINETIS_USBHS_BASE + KINETIS_USBHS_HWTXBUF_OFFSET)
#define KINETIS_USBHS_HWRXBUF                             (KINETIS_USBHS_BASE + KINETIS_USBHS_HWRXBUF_OFFSET)
#define KINETIS_USBHS_GPTIMER0LD                          (KINETIS_USBHS_BASE + KINETIS_USBHS_GPTIMER0LD_OFFSET)
#define KINETIS_USBHS_GPTIMER0CTL                         (KINETIS_USBHS_BASE + KINETIS_USBHS_GPTIMER0CTL_OFFSET)
#define KINETIS_USBHS_GPTIMER1LD                          (KINETIS_USBHS_BASE + KINETIS_USBHS_GPTIMER1LD_OFFSET)
#define KINETIS_USBHS_GPTIMER1CTL                         (KINETIS_USBHS_BASE + KINETIS_USBHS_GPTIMER1CTL_OFFSET)
#define KINETIS_USBHS_HCIVERSION                          (KINETIS_USBHS_BASE + KINETIS_USBHS_HCIVERSION_OFFSET)
#define KINETIS_USBHS_CAPLENGTH                           (KINETIS_USBHS_BASE + KINETIS_USBHS_CAPLENGTH_OFFSET)
#define KINETIS_USBHS_HCSPARAMS                           (KINETIS_USBHS_BASE + KINETIS_USBHS_HCSPARAMS_OFFSET)
#define KINETIS_USBHS_HCCPARAMS                           (KINETIS_USBHS_BASE + KINETIS_USBHS_HCCPARAMS_OFFSET)
#define KINETIS_USBHS_DCIVERSION                          (KINETIS_USBHS_BASE + KINETIS_USBHS_DCIVERSION_OFFSET)
#define KINETIS_USBHS_DCCPARAMS                           (KINETIS_USBHS_BASE + KINETIS_USBHS_DCCPARAMS_OFFSET)
#define KINETIS_USBHS_USBCMD                              (KINETIS_USBHS_BASE + KINETIS_USBHS_USBCMD_OFFSET)
#define KINETIS_USBHS_USBSTS                              (KINETIS_USBHS_BASE + KINETIS_USBHS_USBSTS_OFFSET)
#define KINETIS_USBHS_USBINTR                             (KINETIS_USBHS_BASE + KINETIS_USBHS_USBINTR_OFFSET)
#define KINETIS_USBHS_FRINDEX                             (KINETIS_USBHS_BASE + KINETIS_USBHS_FRINDEX_OFFSET)
#define KINETIS_USBHS_PERIODICLISTBASE                    (KINETIS_USBHS_BASE + KINETIS_USBHS_PERIODICLISTBASE_OFFSET)
#define KINETIS_USBHS_DEVICEADDR                          (KINETIS_USBHS_BASE + KINETIS_USBHS_DEVICEADDR_OFFSET)
#define KINETIS_USBHS_ASYNCLISTADDR                       (KINETIS_USBHS_BASE + KINETIS_USBHS_ASYNCLISTADDR_OFFSET)
#define KINETIS_USBHS_EPLISTADDR                          (KINETIS_USBHS_BASE + KINETIS_USBHS_EPLISTADDR_OFFSET)
#define KINETIS_USBHS_TTCTRL                              (KINETIS_USBHS_BASE + KINETIS_USBHS_TTCTRL_OFFSET)
#define KINETIS_USBHS_BURSTSIZE                           (KINETIS_USBHS_BASE + KINETIS_USBHS_BURSTSIZE_OFFSET)
#define KINETIS_USBHS_TXFILLTUNING                        (KINETIS_USBHS_BASE + KINETIS_USBHS_TXFILLTUNING_OFFSET)
#define KINETIS_USBHS_CONFIGFLAG                          (KINETIS_USBHS_BASE + KINETIS_USBHS_CONFIGFLAG_OFFSET)
#define KINETIS_USBHS_PORTSC1                             (KINETIS_USBHS_BASE + KINETIS_USBHS_PORTSC1_OFFSET)
#define KINETIS_USBHS_OTGSC                               (KINETIS_USBHS_BASE + KINETIS_USBHS_OTGSC_OFFSET)
#define KINETIS_USBHS_MODE                                (KINETIS_USBHS_BASE + KINETIS_USBHS_MODE_OFFSET)
#define KINETIS_USBHS_EPSETUPSR                           (KINETIS_USBHS_BASE + KINETIS_USBHS_EPSETUPSR_OFFSET)
#define KINETIS_USBHS_EPPRIME                             (KINETIS_USBHS_BASE + KINETIS_USBHS_EPPRIME_OFFSET)
#define KINETIS_USBHS_EPFLUSH                             (KINETIS_USBHS_BASE + KINETIS_USBHS_EPFLUSH_OFFSET)
#define KINETIS_USBHS_EPSR                                (KINETIS_USBHS_BASE + KINETIS_USBHS_EPSR_OFFSET)
#define KINETIS_USBHS_EPCOMPLETE                          (KINETIS_USBHS_BASE + KINETIS_USBHS_EPCOMPLETE_OFFSET)
#define KINETIS_USBHS_EPCR0                               (KINETIS_USBHS_BASE + KINETIS_USBHS_EPCR0_OFFSET)
#define KINETIS_USBHS_EPCR1                               (KINETIS_USBHS_BASE + KINETIS_USBHS_EPCR1_OFFSET)
#define KINETIS_USBHS_EPCR2                               (KINETIS_USBHS_BASE + KINETIS_USBHS_EPCR2_OFFSET)
#define KINETIS_USBHS_EPCR3                               (KINETIS_USBHS_BASE + KINETIS_USBHS_EPCR3_OFFSET)
#define KINETIS_USBHS_EPCR4                               (KINETIS_USBHS_BASE + KINETIS_USBHS_EPCR4_OFFSET)
#define KINETIS_USBHS_EPCR5                               (KINETIS_USBHS_BASE + KINETIS_USBHS_EPCR5_OFFSET)
#define KINETIS_USBHS_EPCR6                               (KINETIS_USBHS_BASE + KINETIS_USBHS_EPCR6_OFFSET)
#define KINETIS_USBHS_EPCR7                               (KINETIS_USBHS_BASE + KINETIS_USBHS_EPCR7_OFFSET)
#define KINETIS_USBHS_USBGENCTRL                          (KINETIS_USBHS_BASE + KINETIS_USBHS_USBGENCTRL_OFFSET)

#define KINETIS_USBHSPHY_PWD                              (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_PWD_OFFSET)
#define KINETIS_USBHSPHY_PWD_SET                          (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_PWD_SET_OFFSET)
#define KINETIS_USBHSPHY_PWD_CLR                          (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_PWD_CLR_OFFSET)
#define KINETIS_USBHSPHY_PWD_TOG                          (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_PWD_TOG_OFFSET)
#define KINETIS_USBHSPHY_TX                               (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_TX_OFFSET)
#define KINETIS_USBHSPHY_TX_SET                           (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_TX_SET_OFFSET)
#define KINETIS_USBHSPHY_TX_CLR                           (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_TX_CLR_OFFSET)
#define KINETIS_USBHSPHY_TX_TOG                           (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_TX_TOG_OFFSET)
#define KINETIS_USBHSPHY_RX                               (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_RX_OFFSET)
#define KINETIS_USBHSPHY_RX_SET                           (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_RX_SET_OFFSET)
#define KINETIS_USBHSPHY_RX_CLR                           (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_RX_CLR_OFFSET)
#define KINETIS_USBHSPHY_RX_TOG                           (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_RX_TOG_OFFSET)
#define KINETIS_USBHSPHY_CTRL                             (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_CTRL_OFFSET)
#define KINETIS_USBHSPHY_CTRL_SET                         (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_CTRL_SET_OFFSET)
#define KINETIS_USBHSPHY_CTRL_CLR                         (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_CTRL_CLR_OFFSET)
#define KINETIS_USBHSPHY_CTRL_TOG                         (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_CTRL_TOG_OFFSET)
#define KINETIS_USBHSPHY_STATUS                           (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_STATUS_OFFSET)
#define KINETIS_USBHSPHY_DEBUG_SET                        (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_DEBUG_SET_OFFSET)
#define KINETIS_USBHSPHY_DEBUG_CLR                        (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_DEBUG_CLR_OFFSET)
#define KINETIS_USBHSPHY_DEBUG_TOG                        (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_DEBUG_TOG_OFFSET)
#define KINETIS_USBHSPHY_DEBUG0_STATUS                    (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_DEBUG0_STATUS_OFFSET)
#define KINETIS_USBHSPHY_DEBUG1                           (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_DEBUG1_OFFSET)
#define KINETIS_USBHSPHY_DEBUG1_SET                       (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_DEBUG1_SET_OFFSET)
#define KINETIS_USBHSPHY_DEBUG1_CLR                       (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_DEBUG1_CLR_OFFSET)
#define KINETIS_USBHSPHY_DEBUG1_TOG                       (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_DEBUG1_TOG_OFFSET)
#define KINETIS_USBHSPHY_VERSION                          (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_VERSION_OFFSET)
#define KINETIS_USBHSPHY_PLL_SIC                          (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_PLL_SIC_OFFSET)
#define KINETIS_USBHSPHY_PLL_SIC_SET                      (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_PLL_SIC_SET_OFFSET)
#define KINETIS_USBHSPHY_PLL_SIC_CLR                      (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_PLL_SIC_CLR_OFFSET)
#define KINETIS_USBHSPHY_PLL_SIC_TOG                      (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_PLL_SIC_TOG_OFFSET)
#define KINETIS_USBHSPHY_USB1_VBUS_DETECT                 (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_USB1_VBUS_DETECT_OFFSET)
#define KINETIS_USBHSPHY_USB1_VBUS_DETECT_SET             (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_USB1_VBUS_DETECT_SET_OFFSET)
#define KINETIS_USBHSPHY_USB1_VBUS_DETECT_CLR             (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_USB1_VBUS_DETECT_CLR_OFFSET)
#define KINETIS_USBHSPHY_USB1_VBUS_DETECT_TOG             (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_USB1_VBUS_DETECT_TOG_OFFSET)
#define KINETIS_USBHSPHY_USB1_VBUS_DET_STAT               (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_USB1_VBUS_DET_STAT_OFFSET)
#define KINETIS_USBHSPHY_USB1_CHRG_DET_STAT               (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_USB1_CHRG_DET_STAT_OFFSET)
#define KINETIS_USBHSPHY_ANACTRL                          (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_ANACTRL_OFFSET)
#define KINETIS_USBHSPHY_ANACTRL_SET                      (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_ANACTRL_SET_OFFSET)
#define KINETIS_USBHSPHY_ANACTRL_CLR                      (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_ANACTRL_CLR_OFFSET)
#define KINETIS_USBHSPHY_ANACTRL_TOG                      (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_ANACTRL_TOG_OFFSET)
#define KINETIS_USBHSPHY_USB1_LOOPBACK                    (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_USB1_LOOPBACK_OFFSET)
#define KINETIS_USBHSPHY_USB1_LOOPBACK_SET                (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_USB1_LOOPBACK_SET_OFFSET)
#define KINETIS_USBHSPHY_USB1_LOOPBACK_CLR                (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_USB1_LOOPBACK_CLR_OFFSET)
#define KINETIS_USBHSPHY_USB1_LOOPBACK_TOG                (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_USB1_LOOPBACK_TOG_OFFSET)
#define KINETIS_USBHSPHY_USB1_LOOPBACK_HSFSCNT            (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_USB1_LOOPBACK_HSFSCNT_OFFSET)
#define KINETIS_USBHSPHY_USB1_LOOPBACK_HSFSCNT_SET        (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_USB1_LOOPBACK_HSFSCNT_SET_OFFSET)
#define KINETIS_USBHSPHY_USB1_LOOPBACK_HSFSCNT_CLR        (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_USB1_LOOPBACK_HSFSCNT_CLR_OFFSET)
#define KINETIS_USBHSPHY_USB1_LOOPBACK_HSFSCNT_TOG        (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_USB1_LOOPBACK_HSFSCNT_TOG_OFFSET)
#define KINETIS_USBHSPHY_TRIM_OVERRIDE_EN                 (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_TRIM_OVERRIDE_EN_OFFSET)
#define KINETIS_USBHSPHY_TRIM_OVERRIDE_EN_SET             (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_TRIM_OVERRIDE_EN_SET_OFFSET)
#define KINETIS_USBHSPHY_TRIM_OVERRIDE_EN_CLR             (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_TRIM_OVERRIDE_EN_CLR_OFFSET)
#define KINETIS_USBHSPHY_TRIM_OVERRIDE_EN_TOG             (KINETIS_USBHSPHY_BASE + KINETIS_USBHSPHY_TRIM_OVERRIDE_EN_TOG_OFFSET)

#define KINETIS_USBHSDCD_CONTROL                          (KINETIS_USBHSDCD_BASE + KINETIS_USBHSDCD_CONTROL_OFFSET)
#define KINETIS_USBHSDCD_CLOCK                            (KINETIS_USBHSDCD_BASE + KINETIS_USBHSDCD_CLOCK_OFFSET)
#define KINETIS_USBHSDCD_STATUS                           (KINETIS_USBHSDCD_BASE + KINETIS_USBHSDCD_STATUS_OFFSET)
#define KINETIS_USBHSDCD_SIGNAL_OVERRIDE                  (KINETIS_USBHSDCD_BASE + KINETIS_USBHSDCD_SIGNAL_OVERRIDE_OFFSET)
#define KINETIS_USBHSDCD_TIMER0                           (KINETIS_USBHSDCD_BASE + KINETIS_USBHSDCD_TIMER0_OFFSET)
#define KINETIS_USBHSDCD_TIMER1                           (KINETIS_USBHSDCD_BASE + KINETIS_USBHSDCD_TIMER1_OFFSET)
#define KINETIS_USBHSDCD_TIMER2_BC11                      (KINETIS_USBHSDCD_BASE + KINETIS_USBHSDCD_TIMER2_BC11_OFFSET)
#define KINETIS_USBHSDCD_TIMER2_BC12                      (KINETIS_USBHSDCD_BASE + KINETIS_USBHSDCD_TIMER2_BC12_OFFSET)

