apache/nuttx/arch/arm/src/kinetis/chip/kinetis_usbhs.h
/* Register Bit-Field Definitions ********************************************************************************** */
/* Identification Register */

#define USBHS_ID_VERSIONID_SHIFT                          (29)      /* Bits 31-29: Version ID */
#define USBHS_ID_VERSIONID_MASK                           (0x7 << USBHS_ID_VERSIONID_SHIFT)
#define USBHS_ID_VERSION_SHIFT                            (25)      /* Bits 28-25: Version */
#define USBHS_ID_VERSION_MASK                             (0xf << USBHS_ID_VERSION_SHIFT)
#define USBHS_ID_REVISION_SHIFT                           (21)      /* Bits 24-21: Revision */
#define USBHS_ID_REVISION_MASK                            (0xf << USBHS_ID_REVISION_SHIFT)
#define USBHS_ID_TAG_SHIFT                                (16)      /* Bits 20-16: Tag */
#define USBHS_ID_TAG_MASK                                 (0x1f << USBHS_ID_TAG_SHIFT)
                                                                    /* Bits 15-14: Reserved */
#define USBHS_ID_NID_SHIFT                                (8)       /* Bits 13-8: Ones complement version of ID */
#define USBHS_ID_NID_MASK                                 (0x3f << USBHS_ID_NID_SHIFT)
                                                                    /* Bits 7-6: Reserved */
#define USBHS_ID_ID_SHIFT                                 (0)       /* Bits 6-0: ID Configuration number */
#define USBHS_ID_ID_MASK                                  (0x3f << USBHS_ID_ID_SHIFT)

/* General Hardware Parameters Register */

                                                                    /* Bits 31-11: Reserved */
#define USBHS_HWGENERAL_SM_SHIFT                          (9)       /* Bits 10-9: Serial mode */
#define USBHS_HWGENERAL_SM_MASK                           (0x3 << USBHS_HWGENERAL_SM_SHIFT)
#define USBHS_HWGENERAL_PHYM_SHIFT                        (6)       /* Bits 8-6: PHY Mode */
#define USBHS_HWGENERAL_PHYM_MASK                         (0x7 << USBHS_HWGENERAL_PHYM_SHIFT)
#define USBHS_HWGENERAL_PHYW_SHIFT                        (4)       /* Bits 5-4: PHY Width */
#define USBHS_HWGENERAL_PHYW_MASK                         (0x3 << USBHS_HWGENERAL_PHYW_SHIFT)
                                                                    /* Bits 4-0: Reserved */

/* Host Hardware Parameters Register */

#define USBHS_HWHOST_TTPER_SHIFT                          (24)      /* Bits 31-24: Transaction translator periodic contexts */
#define USBHS_HWHOST_TTPER_MASK                           (0xff << USBHS_HWHOST_TTPER_SHIFT)
#define USBHS_HWHOST_TTASY_SHIFT                          (16)      /* Bits 23-16: Transaction translator contexts */
#define USBHS_HWHOST_TTASY_MASK                           (0xff << USBHS_HWHOST_TTASY_SHIFT)
                                                                    /* Bits 15-4: Reserved */
#define USBHS_HWHOST_NPORT_SHIFT                          (1)       /* Bits 3-1: Number of Ports */
#define USBHS_HWHOST_NPORT_MASK                           (0x7 << USBHS_HWHOST_NPORT_SHIFT)
#define USBHS_HWHOST_HC                                   (1 << 0)  /* Bit 0: Host Capable */

/* Device Hardware Parameters Register */

                                                                    /* Bits 31-6: Reserved */
#define USBHS_HWDEVICE_DEVEP_SHIFT                        (1)       /* Bits 5-1: Device endpoints */
#define USBHS_HWDEVICE_DEVEP_MASK                         (0x1f << USBHS_HWDEVICE_DEVEP_SHIFT)
#define USBHS_HWDEVICE_DC                                 (1 << 0)  /* Bit 0: Device Capable */

/* Transmit Buffer Hardware Parameters Register */

#define USBHS_HWTXBUF_TXLC                                (1 << 31) /* Bit 31: Transmit local Context Registers */
                                                                    /* Bits 30-24: Reserved */
#define USBHS_HWTXBUF_TXCHANADD_SHIFT                     (16)      /* Bits 23-16: Transmit Channel Address */
#define USBHS_HWTXBUF_TXCHANADD_MASK                      (0xff << USBHS_HWTXBUF_TXCHANADD_SHIFT)
#define USBHS_HWTXBUF_TXADD_SHIFT                         (8)       /* Bits 15-8: Transmit Address */
#define USBHS_HWTXBUF_TXADD_MASK                          (0xff << USBHS_HWTXBUF_TXADD_SHIFT)
#define USBHS_HWTXBUF_TXBURST_SHIFT                       (0)       /* Bits 8-0: Transmit Burst */
#define USBHS_HWTXBUF_TXBURST_MASK                        (0xff << USBHS_HWTXBUF_TXBURST_SHIFT)

/* Receive Buffer Hardware Parameters Register */

                                                                    /* Bits 31-16: Reserved */
#define USBHS_HWRXBUF_RXADD_SHIFT                         (8)       /* Bits 15-8: Receive Address */
#define USBHS_HWRXBUF_RXADD_MASK                          (0xff << USBHS_HWRXBUF_RXADD_SHIFT)
#define USBHS_HWRXBUF_RXBURST_SHIFT                       (0)       /* Bits 8-0: Receive Burst */
#define USBHS_HWRXBUF_RXBURST_MASK                        (0xff << USBHS_HWRXBUF_RXBURST_SHIFT)

/* General Purpose Timer n Load Register */

                                                                     /* Bits 31-24: Reserved */
#define USBHS_GPTIMERnLD_GPTLD_SHIFT                      (0)        /* Bits 24-0: Value to be loaded into the countdown timer on reset */
#define USBHS_GPTIMERnLD_GPTLD_MASK                       (0xffffff << USBHS_GPTIMERnLD_GPTLD_SHIFT)

/* General Purpose Timer n Control Register */

#define USBHS_GPTIMERnCTL_RUN                             (1 << 31) /* Bit 31: Timer Run */
#define USBHS_GPTIMERnCTL_RST                             (1 << 30) /* Bit 30: Timer Reset */
                                                                    /* Bits 29-25: Reserved */
#define USBHS_GPTIMERnCTL_MODE                            (1 << 24) /* Bit 24: Timer Mode */
#define USBHS_GPTIMERnCTL_GPTCNT_SHIFT                    (0)       /* Bits 24-0: Timer Count */
#define USBHS_GPTIMERnCTL_GPTCNT_MASK                     (0xffffff << USBHS_GPTIMERnCTL_GPTCNT_SHIFT)

/* System Bus Interface Configuration Register */

                                                                    /* Bits 31-3: Reserved */
#define USBHS_USB_SBUSCFG_BURSTMODE_SHIFT                 (0)       /* Bits 3-0: Burst mode */
#define USBHS_USB_SBUSCFG_BURSTMODE_MASK                  (0x7 << USBHS_USB_SBUSCFG_BURSTMODE_SHIFT)

