apache/nuttx/arch/arm/src/kinetis/chip/kinetis_usbhs.h
/* Host Controller Interface Version and Capability Registers Length Register */

#define USBHS_HCIVERSION_HCIVERSION_SHIFT                 (16)      /* Bits 31-16: EHCI revision number */
#define USBHS_HCIVERSION_HCIVERSION_MASK                  (0xffff << USBHS_HCIVERSION_HCIVERSION_SHIFT)
                                                                    /* Bits 15-8: Reserved */
#define USBHS_HCIVERSION_CAPLENGTH_SHIFT                  (0)       /* Bits 8-0: Capability registers length */
#define USBHS_HCIVERSION_CAPLENGTH_MASK                   (0xff << USBHS_HCIVERSION_CAPLENGTH_SHIFT)

/* Host Controller Structural Parameters Register */

                                                                    /* Bits 31-28: Reserved */
#define USBHS_HCSPARAMS_N_TT_SHIFT                        (24)      /* Bits 27-24: Number of Transaction Translators */
#define USBHS_HCSPARAMS_N_TT_MASK                         (0xf << USBHS_HCSPARAMS_N_TT_SHIFT)
#define USBHS_HCSPARAMS_N_PTT_SHIFT                       (20)      /* Bits 23-20: Ports per Transaction Translator */
#define USBHS_HCSPARAMS_N_PTT_MASK                        (0xf << USBHS_HCSPARAMS_N_PTT_SHIFT)
                                                                    /* Bits 19-17: Reserved */
#define USBHS_HCSPARAMS_PI                                (1 << 16) /* Bit 16: Port Indicators */
#define USBHS_HCSPARAMS_N_CC_SHIFT                        (12)      /* Bits 15-12: Number of Companion Controllers */
#define USBHS_HCSPARAMS_N_CC_MASK                         (0xf << USBHS_HCSPARAMS_N_CC_SHIFT)
#define USBHS_HCSPARAMS_N_PCC_SHIFT                       (8)       /* Bits 11-8: Number Ports per CC */
#define USBHS_HCSPARAMS_N_PCC_MASK                        (0xf << USBHS_HCSPARAMS_N_PCC_SHIFT)
                                                                    /* Bits 7-5: Reserved */
#define USBHS_HCSPARAMS_PPC                               (1 << 4)  /* Bit 4: Power Port Control */
#define USBHS_HCSPARAMS_N_PORTS_SHIFT                     (0)       /* Bits 4-0: Number of Ports */
#define USBHS_HCSPARAMS_N_PORTS_MASK                      (0xf << USBHS_HCSPARAMS_N_PORTS_SHIFT)

/* Host Controller Capability Parameters Register */

                                                                    /* Bits 31-16: Reserved */
#define USBHS_HCCPARAMS_EECP_SHIFT                        (8)       /* Bits 15-8: EHCI Extended Capabilities Pointer */
#define USBHS_HCCPARAMS_EECP_MASK                         (0xff << USBHS_HCCPARAMS_EECP_SHIFT)
#define USBHS_HCCPARAMS_IST_SHIFT                         (4)       /* Bits 7-4: Isochronous Scheduling Threshold */
#define USBHS_HCCPARAMS_IST_MASK                          (0xf << USBHS_HCCPARAMS_IST_SHIFT)
                                                                    /* Bit 3: Reserved */
#define USBHS_HCCPARAMS_ASP                               (1 << 2)  /* Bit 2: Asynchronous Schedule Park capability */
#define USBHS_HCCPARAMS_PFL                               (1 << 1)  /* Bit 1: Programmable Frame List flag */
#define USBHS_HCCPARAMS_ADC                               (1 << 0)  /* Bit 0: 64-bit addressing capability */

/* Device Controller Capability Parameters */

                                                                    /* Bits 31-9: Reserved */
#define USBHS_DCCPARAMS_HC                                (1 << 8)  /* Bit 8: Host Capable */
#define USBHS_DCCPARAMS_DC                                (1 << 7)  /* Bit 7: Device Capable */
                                                                    /* Bits 6-5: Reserved */
#define USBHS_DCCPARAMS_DEN_SHIFT                         (0)       /* Bits 5-0: Device Endpoint Number */
#define USBHS_DCCPARAMS_DEN_MASK                          (0x1f << USBHS_DCCPARAMS_DEN_SHIFT)

/* USB Command Register */

                                                                    /* Bits 31-24: Reserved */
#define USBHS_USBCMD_ITC_SHIFT                            (16)      /* Bits 23-16: Interrupt Threshold Control */
#define USBHS_USBCMD_ITC_MASK                             (0xff << USBHS_USBCMD_ITC_SHIFT)
#define USBHS_USBCMD_FS2                                  (1 << 15) /* Bit 15: Frame list Size 2 */
#define USBHS_USBCMD_ATDTW                                (1 << 14) /* Bit 14: Add dTD TripWire */
#define USBHS_USBCMD_SUTW                                 (1 << 13) /* Bit 13: Setup TripWire */
                                                                    /* Bit 12: Reserved */
#define USBHS_USBCMD_ASPE                                 (1 << 11) /* Bit 11: Asynchronous Schedule Park mode Enable */
                                                                    /* Bit 10: Reserved */
#define USBHS_USBCMD_ASP_SHIFT                            (8)       /* Bits 9-8: Asynchronous Schedule Park mode count */
#define USBHS_USBCMD_ASP_MASK                             (0x3 << USBHS_USBCMD_ASP_SHIFT)
                                                                    /* Bit 7: Reserved */
#define USBHS_USBCMD_IAA                                  (1 << 6)  /* Bit 6: Interrupt on Async Advance doorbell */
#define USBHS_USBCMD_ASE                                  (1 << 5)  /* Bit 5: Asynchronous Schedule Enable */
#define USBHS_USBCMD_PSE                                  (1 << 4)  /* Bit 4: Periodic Schedule Enable */
#define USBHS_USBCMD_FS_SHIFT                             (2)       /* Bits 3-2: Frame list Size */
#define USBHS_USBCMD_FS_MASK                              (0x3 << USBHS_USBCMD_FS_SHIFT)
#define USBHS_USBCMD_RST                                  (1 << 1)  /* Bit 1: Controller Reset */
#define USBHS_USBCMD_RS                                   (1 << 0)  /* Bit 0: Run/Stop */

/* USB Status Register */

                                                                    /* Bits 31-26: Reserved */
#define USBHS_USBSTS_TI1                                  (1 << 25) /* Bit 25: General purpose Timer 1 Interrupt */
#define USBHS_USBSTS_TI0                                  (1 << 24) /* Bit 24: General purpose Timer 0 Interrupt */
                                                                    /* Bits 23-20: Reserved */
#define USBHS_USBSTS_UPIUSB                               (1 << 19) /* Bit 19:  host Periodic Interrupt */
#define USBHS_USBSTS_UAI                                  (1 << 18) /* Bit 18: USB host Asynchronous Interrupt */
                                                                    /* Bit 17: Reserved */
#define USBHS_USBSTS_NAKI                                 (1 << 16) /* Bit 16: NAK Interrupt */
#define USBHS_USBSTS_AS                                   (1 << 15) /* Bit 15: Asynchronous schedule Status */
#define USBHS_USBSTS_PS                                   (1 << 14) /* Bit 14: Periodic schedule Status */
#define USBHS_USBSTS_RCL                                  (1 << 13) /* Bit 13: Reclamation */
#define USBHS_USBSTS_HCH                                  (1 << 12) /* Bit 12: Host Controller Halted */
                                                                    /* Bits 9-11: Reserved */
#define USBHS_USBSTS_SLI                                  (1 << 8)  /* Bit 8: Device-controller suspend */
#define USBHS_USBSTS_SRI                                  (1 << 7)  /* Bit 7: SOF Received */
#define USBHS_USBSTS_URI                                  (1 << 6)  /* Bit 6: USB Reset received */
#define USBHS_USBSTS_AAI                                  (1 << 5)  /* Bit 5: Interrupt on Async Advance */
#define USBHS_USBSTS_SEI                                  (1 << 4)  /* Bit 4: System Error */
#define USBHS_USBSTS_FRI                                  (1 << 3)  /* Bit 3: Port Change detect */
#define USBHS_USBSTS_PCI                                  (1 << 2)  /* Bit 2: Port Change detect */
#define USBHS_USBSTS_UEI                                  (1 << 1)  /* Bit 1: USB Error Interrupt */
#define USBHS_USBSTS_UI                                   (1 << 0)  /* Bit 0: USB Interrupt (USBINT) */

/* USB Interrupt Enable Register */

                                                                    /* Bits 31-26: Reserved */
#define USBHS_USBINTR_TIE1                                (1 << 25) /* Bit 25: General purpose Timer 1 Interrupt Enable */
#define USBHS_USBINTR_TIE0                                (1 << 24) /* Bit 24: General purpose Timer 0 Interrupt Enable */
                                                                    /* Bits 23-20: Reserved */
#define USBHS_USBINTR_UPIE                                (1 << 19) /* Bit 19: USB host Periodic Interrupt Enable */
#define USBHS_USBINTR_UAIE                                (1 << 18) /* Bit 18: USB host Asynchronous Interrupt Enable */
                                                                    /* Bit 17: Reserved */
#define USBHS_USBINTR_NAKE                                (1 << 16) /* Bit 16: NAK Interrupt Enable */
                                                                    /* Bits 9-15: Reserved */
#define USBHS_USBINTR_SLE                                 (1 << 8)  /* Bit 8: Sleep (DC suspend) Enable */
#define USBHS_USBINTR_SRE                                 (1 << 7)  /* Bit 7: SOF-Received Enable */
#define USBHS_USBINTR_URE                                 (1 << 6)  /* Bit 6: USB-Reset Enable */
#define USBHS_USBINTR_AAE                                 (1 << 5)  /* Bit 5: Interrupt on Async advance Enable */
#define USBHS_USBINTR_SEE                                 (1 << 4)  /* Bit 4: System Error Enable */
#define USBHS_USBINTR_FRE                                 (1 << 3)  /* Bit 3: Frame list Rollover Enable */
#define USBHS_USBINTR_PCE                                 (1 << 2)  /* Bit 2: Port Change detect Enable */
#define USBHS_USBINTR_UEE                                 (1 << 1)  /* Bit 1: USB Error interrupt Enable */
#define USBHS_USBINTR_UE                                  (1 << 0)  /* Bit 0: USB interrupt Enable */

/* Frame Index Register */

                                                                    /* Bits 14-31: Reserved */
#define USBHS_FRINDEX_FRINDEX_SHIFT                       (0)       /* Bits 0-13: Frame Index */
#define USBHS_FRINDEX_FRINDEX_MASK                        (0x3fff << USBHS_FRINDEX_FRINDEX_SHIFT)

