apache/nuttx/arch/arm/src/kinetis/chip/kinetis_usbhs.h
/* Periodic Frame List Base Address Register */

#define USBHS_PERIODICLISTBASE_PERBASE_SHIFT              (12)      /* Bits 12-31: Base address */
#define USBHS_PERIODICLISTBASE_PERBASE_MASK               (0xfffff << USBHS_PERIODICLISTBASE_PERBASE_SHIFT)
                                                                    /* Bits 0-12: Reserved */

/* Device Address Register */

#define USBHS_DEVICEADDR_USBADR_SHIFT                     (25)      /* Bits 25-31: Device Address */
#define USBHS_DEVICEADDR_USBADR_MASK                      (0x7f << USBHS_DEVICEADDR_USBADR_SHIFT)
#define USBHS_DEVICEADDR_USBADRA                          (1 << 24) /* Bit 24: Device Address Advance */
                                                                    /* Bits 0-24: Reserved */

/* Current Asynchronous List Address Register */

#define USBHS_ASYNCLISTADDR_ASYBASE_SHIFT                 (5)       /* Bits 5-31: Link pointer low (LPL) */
#define USBHS_ASYNCLISTADDR_ASYBASE_MASK                  (0x7ffffff << USBHS_ASYNCLISTADDR_ASYBASE_SHIFT)
                                                                    /* Bits 0-5: Reserved */

/* Endpoint List Address Register */

#define USBHS_EPLISTADDR_EPBASE_SHIFT                     (11)      /* Bits 11-31: Endpoint list address */
#define USBHS_EPLISTADDR_EPBASE_MASK                      (0x1fffff << USBHS_EPLISTADDR_EPBASE_SHIFT)
                                                                    /* Bits 0-11: Reserved */

/* Host TT Asynchronous Buffer Control */

                                                                    /* Bit 31: Reserved */
#define USBHS_TTCTRL_TTHA_SHIFT                           (24)      /* Bits 24-30: TT Hub Address */
#define USBHS_TTCTRL_TTHA_MASK                            (0x7f << USBHS_TTCTRL_TTHA_SHIFT)
                                                                    /* Bits 0-23: Reserved */

/* Master Interface Data Burst Size Register */

                                                                    /* Bits 16-31: Reserved */
#define USBHS_BURSTSIZE_TXPBURST_SHIFT                    (8)       /* Bits 8-15: Programable TX Burst length */
#define USBHS_BURSTSIZE_TXPBURST_MASK                     (0xff << USBHS_BURSTSIZE_TXPBURST_SHIFT)
#define USBHS_BURSTSIZE_RXPBURST_SHIFT                    (0)       /* Bits 0-7: Programable RX Burst length */
#define USBHS_BURSTSIZE_RXPBURST_MASK                     (0xff << USBHS_BURSTSIZE_RXPBURST_SHIFT)

/* Transmit FIFO Tuning Control Register */

                                                                    /* Bits 31-22: Reserved */
#define USBHS_TXFILLTUNING_TXFIFOTHRES_SHIFT              (16)      /* Bits 21-16: FIFO burst Threshold */
#define USBHS_TXFILLTUNING_TXFIFOTHRES_MASK               (0x3f << USBHS_TXFILLTUNING_TXFIFOTHRES_SHIFT)
                                                                    /* Bits 15-13: Reserved */
#define USBHS_TXFILLTUNING_TXSCHHEALTH_SHIFT              (8)       /* Bits 12-8: Scheduler Health counter */
#define USBHS_TXFILLTUNING_TXSCHHEALTH_MASK               (0x1f << USBHS_TXFILLTUNING_TXSCHHEALTH_SHIFT)
                                                                    /* Bit 7: Reserved */
#define USBHS_TXFILLTUNING_TXSCHOH_SHIFT                  (0)       /* Bits 0-6: Scheduler Overhead */
#define USBHS_TXFILLTUNING_TXSCHOH_MASK                   (0x7f << USBHS_TXFILLTUNING_TXSCHOH_SHIFT)

/* Endpoint NAK Register */

                                                                    /* Bits 20-31: Reserved */
#define USBHS_ENDPTNAK_EPTN_SHIFT                         (16)      /* Bits 19-16: TX Endpoint NAK */
#define USBHS_ENDPTNAK_EPTN_MASK                          (0xf << USBHS_ENDPTNAK_EPTN_SHIFT)
                                                                    /* Bits 4-15: Reserved */
#define USBHS_ENDPTNAK_EPRN_SHIFT                         (0)       /* Bits 0-4: RX Endpoint NAK */
#define USBHS_ENDPTNAK_EPRN_MASK                          (0xf << USBHS_ENDPTNAK_EPRN_SHIFT)

/* Endpoint NAK Enable Register */

                                                                    /* Bits 20-31: Reserved */
#define USBHS_ENDPTNAKEN_EPTNE_SHIFT                      (16)      /* Bits 16-19: TX Endpoint NAK */
#define USBHS_ENDPTNAKEN_EPTNE_MASK                       (0xf << USBHS_ENDPTNAKEN_EPTNE_SHIFT)
                                                                    /* Bits 4-15: Reserved */
#define USBHS_ENDPTNAKEN_EPRNE_SHIFT                      (0)       /* Bits 0-3: RX Endpoint NAK */
#define USBHS_ENDPTNAKEN_EPRNE_MASK                       (0xf << USBHS_ENDPTNAKEN_EPRNE_SHIFT)

/* Configure Flag Register (reserved) */

/* Port Status and Control Registers */

#define USBHS_PORTSC1_PTS_SHIFT                           (30)      /* Bits 30-31: Port Transceiver Select [1:0] */
#define USBHS_PORTSC1_PTS_MASK                            (0x3 << USBHS_PORTSC1_PTS_SHIFT)
                                                                    /* Bit 28-29: Reserved */
#define USBHS_PORTSC1_PSPD_SHIFT                          (26)      /* Bits 26-27: Port Speed */
#define USBHS_PORTSC1_PSPD_MASK                           (0x3 << USBHS_PORTSC1_PSPD_SHIFT)
#  define USBHS_PORTSC1_PTS2                              (1 << 25) /* Bit 25: Port Transceiver Select [2] */
#  define USBHS_PORTSC1_PFSC                              (1 << 24) /* Bit 24: Port force Full-Speed Connect */
#  define USBHS_PORTSC1_PHCD                              (1 << 23) /* Bit 23: PHY low power suspend */
#  define USBHS_PORTSC1_WKOC                              (1 << 22) /* Bit 22: Wake on Over-Current enable */
#  define USBHS_PORTSC1_WKDS                              (1 << 21) /* Bit 21: Wake on Disconnect enable */
#  define USBHS_PORTSC1_WKCN                              (1 << 20) /* Bit 20: Wake on Connect enable */
#define USBHS_PORTSC1_PTC_SHIFT                           (16)      /* Bits 16-19: Port Test Control */
#define USBHS_PORTSC1_PTC_MASK                            (0xf << USBHS_PORTSC1_PTC_SHIFT)
#define USBHS_PORTSC1_PIC_SHIFT                           (14)      /* Bits 14-15: Port Indicator Control */
#define USBHS_PORTSC1_PIC_MASK                            (0x3 << USBHS_PORTSC1_PIC_SHIFT)
#define USBHS_PORTSC1_PO                                  (1 << 13) /* Bit 13: Port Owner */
#define USBHS_PORTSC1_PP                                  (1 << 12) /* Bit 12: Port Power */
#define USBHS_PORTSC1_LS_SHIFT                            (10)      /* Bits 11-10: Line Status */
#define USBHS_PORTSC1_LS_MASK                             (0x3 << USBHS_PORTSC1_LS_SHIFT)
#define USBHS_PORTSC1_HSP                                 (1 << 9)  /* Bit 9: High Speed Port */
#define USBHS_PORTSC1_PR                                  (1 << 8)  /* Bit 8: Port Reset */
#define USBHS_PORTSC1_SUSP                                (1 << 7)  /* Bit 7: Suspend */
#define USBHS_PORTSC1_FPR                                 (1 << 6)  /* Bit 6: Force Port Resume */
#define USBHS_PORTSC1_OCC                                 (1 << 5)  /* Bit 5: Over-Current Change */
#define USBHS_PORTSC1_OCA                                 (1 << 4)  /* Bit 4: Over-current active */
#define USBHS_PORTSC1_PEC                                 (1 << 3)  /* Bit 3: Port Enable/disable Change */
#define USBHS_PORTSC1_PE                                  (1 << 2)  /* Bit 2: Port Enabled/disabled */
#define USBHS_PORTSC1_CSC                                 (1 << 1)  /* Bit 1: Connect Change Status */
#define USBHS_PORTSC1_CCS                                 (1 << 0)  /* Bit 0: Current Connect Status */

/* On-the-Go Status and Control Register */

                                                                    /* Bit 31: Reserved */
#define USBHS_OTGSC_DPIE                                  (1 << 30) /* Bit 30: Data Pulse Interrupt Enable */
#define USBHS_OTGSC_MSE                                   (1 << 29) /* Bit 29: 1 Milli-Second timer interrupt Enable */
#define USBHS_OTGSC_BSEIE                                 (1 << 28) /* Bit 28: B Session End Interrupt Enable */
#define USBHS_OTGSC_BSVIE                                 (1 << 27) /* Bit 27: B Session Valid Interrupt Enable */
#define USBHS_OTGSC_ASVIE                                 (1 << 26) /* Bit 26: A Session Valid Interrupt Enable */
#define USBHS_OTGSC_AVVIE                                 (1 << 25) /* Bit 25: A VBUS Valid Interrupt Enable */
#define USBHS_OTGSC_IDIE                                  (1 << 24) /* Bit 24: USB ID Interrupt Enable */
                                                                    /* Bit 23: Reserved */
#define USBHS_OTGSC_DPIS                                  (1 << 22) /* Bit 22: Data Pulse interrupt Status */
#define USBHS_OTGSC_MSS                                   (1 << 21) /* Bit 21: 1 Milli-Second timer interrupt Status */
#define USBHS_OTGSC_BSEIS                                 (1 << 20) /* Bit 20: B Session End Interrupt Status */
#define USBHS_OTGSC_BSVIS                                 (1 << 19) /* Bit 19: B Session Valid Interrupt Status */
#define USBHS_OTGSC_ASVIS                                 (1 << 18) /* Bit 18: A Session Valid Interrupt Status */
#define USBHS_OTGSC_AVVIS                                 (1 << 17) /* Bit 17: A VBUS Valid Interrupt Status */
#define USBHS_OTGSC_IDIS                                  (1 << 16) /* Bit 16: USB ID Interrupt Status */
                                                                    /* Bit 15: Reserved */
#define USBHS_OTGSC_DPS                                   (1 << 14) /* Bit 14: Data bus Pulsing Status */
#define USBHS_OTGSC_MST                                   (1 << 13) /* Bit 13: 1 Milli-Second timer Toggle */
#define USBHS_OTGSC_BSE                                   (1 << 12) /* Bit 12: B Session End */
#define USBHS_OTGSC_BSV                                   (1 << 11) /* Bit 11: B Session Valid */
#define USBHS_OTGSC_ASV                                   (1 << 10) /* Bit 10: A Session Valid */
#define USBHS_OTGSC_AVV                                   (1 << 9)  /* Bit 9: A VBus Valid */
#define USBHS_OTGSC_ID                                    (1 << 8)  /* Bit 8: USB ID */
#define USBHS_OTGSC_HABA                                  (1 << 7)  /* Bit 7: Hardware Assist B-Disconnect to A-connect */
                                                                    /* Bit 6: Reserved */
#define USBHS_OTGSC_IDPU                                  (1 << 5)  /* Bit 5: ID Pull-Up */
#define USBHS_OTGSC_DP                                    (1 << 4)  /* Bit 4: Data Pulsing */
#define USBHS_OTGSC_OT                                    (1 << 3)  /* Bit 3: OTG Termination */
#define USBHS_OTGSC_HAAR                                  (1 << 2)  /* Bit 2: Hardware Assist Auto-Reset */
#define USBHS_OTGSC_VC                                    (1 << 1)  /* Bit 1: VBUS Charge */
#define USBHS_OTGSC_VD                                    (1 << 0)  /* Bit 0: VBUS Discharge */

/* USB Mode Register */

                                                                    /* Bits 15-31: Reserved */
#define USBHS_USBMODE_TXHSD_SHIFT                         (12)      /* Bits 12-14: Tx to Tx HS Delay */
#define USBHS_USBMODE_TXHSD_MASK                          (0x7 << USBHS_USBMODE_TXHSD_SHIFT)
                                                                    /* Bits 5-11: Reserved */
#define USBHS_USBMODE_SDIS                                (1 << 4)  /* Bit 4: Stream DISable */
#define USBHS_USBMODE_SLOM                                (1 << 3)  /* Bit 3: Setup Lock-Out Mode */
#define USBHS_USBMODE_ES                                  (1 << 2)  /* Bit 2: Endian Select */
#define USBHS_USBMODE_CM_SHIFT                            (0)       /* Bits 2-0: Controller Mode */
#define USBHS_USBMODE_CM_MASK                             (0x3 << USBHS_USBMODE_CM_SHIFT)

/* Endpoint Setup Status Register */

                                                                    /* Bits 31-4: Reserved */
#define USBHS_EPSETUPSR_EPSETUPSTAT_SHIFT                 (0)       /* Bits 4-0: Setup Endpoint Status */
#define USBHS_EPSETUPSR_EPSETUPSTAT_MASK                  (0xf << USBHS_EPSETUPSR_EPSETUPSTAT_SHIFT)

/* Endpoint Initialization Register */

                                                                    /* Bits 20-31: Reserved */
#define USBHS_EPPRIME_PETB_SHIFT                          (16)      /* Bits 16-19: Prime Endpoint Tansmit Buffer */
#define USBHS_EPPRIME_PETB_MASK                           (0xf << USBHS_EPPRIME_PETB_SHIFT)
                                                                    /* Bits 4-15: Reserved */
#define USBHS_EPPRIME_PERB_SHIFT                          (0)       /* Bits 0-3: Prime Endpoint Receive Buffer */
#define USBHS_EPPRIME_PERB_MASK                           (0xf << USBHS_EPPRIME_PERB_SHIFT)

