apache/nuttx/arch/arm/src/kinetis/chip/kinetis_usbhs.h
/* Endpoint Flush Register */

                                                                    /* Bits 20-31: Reserved */
#define USBHS_EPFLUSH_FETB_SHIFT                           (16)     /* Bits 19-16: Flush Endpoint Transmit Buffer */
#define USBHS_EPFLUSH_FETB_MASK                            (0xf << USBHS_EPFLUSH_FETB_SHIFT)
                                                                    /* Bits 4-15: Reserved */
#define USBHS_EPFLUSH_FERB_SHIFT                           (0)      /* Bits 0-3: Flush Endpoint Receive Buffer */
#define USBHS_EPFLUSH_FERB_MASK                            (0xf << USBHS_EPFLUSH_FERB_SHIFT)

/* Endpoint Status Register */

                                                                    /* Bits 31-20: Reserved */
#define USBHS_EPSR_ETBR_SHIFT                             (16)      /* Bits 19-16: Endpoint Transmit Buffer Ready */
#define USBHS_EPSR_ETBR_MASK                              (0xf << USBHS_EPSR_ETBR_SHIFT)
                                                                    /* Bits 15-4: Reserved */
#define USBHS_EPSR_ERBR_SHIFT                             (0)       /* Bits 0-3: Endpoint Receive Buffer Ready */
#define USBHS_EPSR_ERBR_MASK                              (0xf << USBHS_EPSR_ERBR_SHIFT)

/* Endpoint Complete Register */

                                                                    /* Bits 20-31: Reserved */
#define USBHS_EPCOMPLETE_ETCE_SHIFT                       (16)      /* Bits 16-19: Endpoint Transmit Complete Event */
#define USBHS_EPCOMPLETE_ETCE_MASK                        (0xf << USBHS_EPCOMPLETE_ETCE_SHIFT)
                                                                    /* Bits 4-15: Reserved */
#define USBHS_EPCOMPLETE_ERCE_SHIFT                       (0)       /* Bits 0-3: Endpoint Receive Complete Event */
#define USBHS_EPCOMPLETE_ERCE_MASK                        (0xf << USBHS_EPCOMPLETE_ERCE_SHIFT)

/* Endpoint Control Register 0 */

                                                                    /* Bits 24-31: Undefined */
#define USBHS_EPCR0_TXE                                   (1 << 23) /* Bit 23: TX Endpoint Enable */
                                                                    /* Bits 20-22: Reserved */
#define USBHS_EPCR0_TXT_SHIFT                             (18)      /* Bits 18-19: TX Endpoint Type */
#define USBHS_EPCR0_TXT_MASK                              (0x3 << USBHS_EPCR0_TXT_SHIFT)
                                                                    /* Bit 17: Reserved */
#define USBHS_EPCR0_TXS                                   (1 << 16) /* Bit 16: TX Endpoint Stall */
                                                                    /* Bits 8-15: Reserved */
#define USBHS_EPCR0_RXE                                   (1 << 7)  /* Bit 7: RX endpoint Enable */
                                                                    /* Bits 4-6: Reserved */
#define USBHS_EPCR0_RXT_SHIFT                             (2)       /* Bits 2-3: RX endpoint Type */
#define USBHS_EPCR0_RXT_MASK                              (0x3 << USBHS_EPCR0_RXT_SHIFT)
                                                                    /* Bit 1: Reserved */
#define USBHS_EPCR0_RXS                                   (1 << 0)  /* Bit 0: RX endpoint Stall */

/* Endpoint Control Register n */

                                                                    /* Bits 24-31: Reserved */
#define USBHS_EPCRn_TXE                                   (1 << 23) /* Bit 23: TX endpoint Enable */
#define USBHS_EPCRn_TXR                                   (1 << 22) /* Bit 22: TX data toggle Reset */
#define USBHS_EPCRn_TXI                                   (1 << 21) /* Bit 21: TX data toggle Inhibit */
                                                                    /* Bit 20: Reserved */
#define USBHS_EPCRn_TXT_SHIFT                             (18)      /* Bits 18-19: TX endpoint Type */
#define USBHS_EPCRn_TXT_MASK                              (0x3 << USBHS_EPCRn_TXT_SHIFT)
#define USBHS_EPCRn_TXD                                   (1 << 17) /* Bit 17: TX endpoint Data source */
#define USBHS_EPCRn_TXS                                   (1 << 16) /* Bit 16: TX endpoint Stall */
                                                                    /* Bits 8-15: Reserved */
#define USBHS_EPCRn_RXE                                   (1 << 7)  /* Bit 7: RX endpoint Enable */
#define USBHS_EPCRn_RXR                                   (1 << 6)  /* Bit 6: RX data toggle Reset */
#define USBHS_EPCRn_RXI                                   (1 << 5)  /* Bit 5: RX data toggle Inhibit */
                                                                    /* Bit 4: Reserved */
#define USBHS_EPCRn_RXT_SHIFT                             (2)       /* Bits 2-3: RX endpoint Type */
#define USBHS_EPCRn_RXT_MASK                              (0x3 << USBHS_EPCRn_RXT_SHIFT)
#define USBHS_EPCRn_RXD                                   (1 << 1)  /* Bit 1: RX endpoint Data sink */
#define USBHS_EPCRn_RXS                                   (1 << 0)  /* Bit 0: RX endpoint Stall */

/* USB General Control Register */

                                                                    /* Bits 6-31: Reserved */
#define USBHS_USBGENCTRL_WU_INT_CLR                       (1 << 5)  /* Bit 5: Wakeup Interrupt Clear */
                                                                    /* Bits 1-4: Reserved */
#define USBHS_USBGENCTRL_WU_IE                            (1 << 0)  /* Bit 0: Wakeup Interrupt Enable */

/* USB PHY Power-Down Register */

                                                                    /* Bits 21-31: Reserved */
#define USBPHY_PWDn_RXPWDRX                               (1 << 20) /* Bit 20: Auto cleared if USB wakeup while ENAUTOCLR_PHY_PWD */
#define USBPHY_PWDn_RXPWDDIFF                             (1 << 19) /* Bit 19: Auto cleared if USB wakeup while ENAUTOCLR_PHY_PWD */
#define USBPHY_PWDn_RXPWD1PT1                             (1 << 18) /* Bit 18: Auto cleared if USB wakeup while ENAUTOCLR_PHY_PWD */
#define USBPHY_PWDn_RXPWDENV                              (1 << 17) /* Bit 17: Auto cleared if USB wakeup while ENAUTOCLR_PHY_PWD */
                                                                    /* Bits 13-16: Reserved */
#define USBPHY_PWDn_TXPWDV2I                              (1 << 12) /* Bit 12: Auto cleared if USB wakeup while ENAUTOCLR_PHY_PWD */
#define USBPHY_PWDn_TXPWDIBIAS                            (1 << 11) /* Bit 11: Auto cleared if USB wakeup while ENAUTOCLR_PHY_PWD */
#define USBPHY_PWDn_TXPWDFS                               (1 << 10) /* Bit 10: Auto cleared if USB wakeup while ENAUTOCLR_PHY_PWD */
                                                                    /* Bits 0-9: Reserved */

/* USB PHY Transmitter Control Register */

#define USBPHY_TXn_USBPHY_TX_EDGECTRL_SHIFT               (29)      /* Bits 28-26: Edge-rate of the current sensing in HS transmit */
#define USBPHY_TXn_USBPHY_TX_EDGECTRL_MASK                (0x7 << USBPHY_TXn_USBPHY_TX_EDGECTRL_SHIFT)
                                                                    /* Bit 20-25: Reserved */
#define USBPHY_TXn_TXCAL45DP_SHIFT                        (19)      /* Bits 19-16: Trim termination resistance to the USB_DP output */
#define USBPHY_TXn_TXCAL45DP_MASK                         (0xf << USBPHY_TXn_TXCAL45DP_SHIFT)
                                                                    /* Bits 12-15: Reserved */
#define USBPHY_TXn_TXCAL45DM_SHIFT                        (11)      /* Bits 11-8: Trim termination resistance to the USB_DM output */
#define USBPHY_TXn_TXCAL45DM_MASK                         (0xf << USBPHY_TXn_TXCAL45DM_SHIFT)
                                                                    /* Bits 7-4: Reserved */
#define USBPHY_TXn_D_CAL_SHIFT                            (0)       /* Bits 7-0: Trim current source for the High Speed TX drivers */
#define USBPHY_TXn_D_CAL_MASK                             (0x7f << USBPHY_TXn_D_CAL_SHIFT)

/* USB PHY Receiver Control Register */

                                                                    /* Bits 23-31: Reserved */
#define USBPHY_RXn_RXDBYPASS                              (1 << 22) /* Bit 22: Test mode, replace FS differential receiver with DP single ended receiver */
                                                                    /* Bits 7-21: Reserved */
#define USBPHY_RXn_DISCONADJ_SHIFT                        (4)       /* Bits 6-4: Adjusts the trip point for the disconnect detector */
#define USBPHY_RXn_DISCONADJ_MASK                         (0x7 << USBPHY_RXn_DISCONADJ_SHIFT)
                                                                    /* Bit 3: Reserved */
#define USBPHY_RXn_ENVADJ_SHIFT                           (0)       /* Bits 3-0:  Adjusts the trip point for the envelope detector */
#define USBPHY_RXn_ENVADJ_MASK                            (0x7 << USBPHY_RXn_ENVADJ_SHIFT)

/* USB PHY General Control Register */

#define USBPHY_CTRLn_SFTRST                               (1 << 31) /* Bit 31: Soft-reset the USBPHY_PWD, USBPHY_TX, USBPHY_RX, and USBPHY_CTRL */
#define USBPHY_CTRLn_CLKGATE                              (1 << 30) /* Bit 30: Gate UTMI Clocks */
#define USBPHY_CTRLn_UTMI_SUSPENDM                        (1 << 29) /* Bit 29: Indicats powered-down state */
#define USBPHY_CTRLn_HOST_FORCE_LS_SE0                    (1 << 28) /* Bit 28: Forces next FS packet tohave a EOP with low-speed timing */
#define USBPHY_CTRLn_OTG_ID_VALUE                         (1 << 27) /* Bit 27: Indicates the results of USB_ID pin  */
                                                                    /* Bit 25-26: Reserved */
#define USBPHY_CTRLn_FSDLL_RST_EN                         (1 << 24) /* Bit 24: Reset ofthe FSDLL lock detection logic at the end of each TX packet */
                                                                    /* Bit 21-23: Reserved */
#define USBPHY_CTRLn_ENAUTOCLR_PHY_PWD                    (1 << 20) /* Bit 20: Auto-clear the PWD register bits in USBPHY_PWD if wakeup event while suspended */
#define USBPHY_CTRLn_ENAUTOCLR_CLKGATE                    (1 << 19) /* Bit 19: Auto-clear the CLKGATE bit if wakeup event while suspended */
#define USBPHY_CTRLn_AUTORESUME_EN                        (1 << 18) /* Bit 18: Auto resume, HW will send Resume to respond to the device remote wakeup */
                                                                    /* Bit 16-17: Reserved */
#define USBPHY_CTRLn_ENUTMILEVEL3                         (1 << 15) /* Bit 15: Enables UTMI+ Level 3 operation for the USB HS PHY */
#define USBPHY_CTRLn_ENUTMILEVEL2                         (1 << 14) /* Bit 14: Enables UTMI+ Level 2 operation for the USB HS PHY */
                                                                    /* Bit 13: Reserved */
#define USBPHY_CTRLn_DEVPLUGIN_IRQ                        (1 << 12) /* Bit 12: Indicates device is connected */
                                                                    /* Bits 5-11: Reserved */
#define USBPHY_CTRLn_ENDEVPLUGINDET                       (1 << 4)  /* Bit 4: Enables non-standard resistive plugged-in detection */
#define USBPHY_CTRLn_HOSTDISCONDETECT_IRQ                 (1 << 3)  /* Bit 3: Indicates that the device has disconnected in High-Speed mode */
                                                                    /* Bit 2: Reserved */
#define USBPHY_CTRLn_ENHOSTDISCONDETECT                   (1 << 1)  /* Bit 1: For host mode, enables high-speed disconnect detector */
                                                                    /* Bit 0: Reserved */

/* USB PHY Status Register */

                                                                    /* Bits 11-31: Reserved */
#define USBPHY_STATUS_RESUME_STATUS                       (1 << 10) /* Bit 10: Indicates that the host is sending a wake-up after Suspend */
                                                                    /* Bit 9: Reserved */
#define USBPHY_STATUS_OTGID_STATUS                        (1 << 8)  /* Bit 8: Indicates the results of USB_ID pin on the USB cable */
                                                                    /* Bit 7: Reserved */
#define USBPHY_STATUS_DEVPLUGIN_STATUS                    (1 << 6)  /* Bit 6: Status indicator for non-standard resistive plugged-in detection */
                                                                    /* Bits 4-5: Reserved */
#define USBPHY_STATUS_HOSTDISCONDETECT_STATUS             (1 << 3)  /* Bit 3: Indicates at that the remote device has disconnected while in High-Speed mode */
                                                                    /* Bits 0-2: Reserved */

/* USB PHY Debug Register */

                                                                    /* Bit 31: Reserved */
#define USBPHY_DEBUGn_CLKGATE                             (1 << 30) /* Bit 30: Gate Test Clocks */
#define USBPHY_DEBUGn_HOST_RESUME_DEBUG                   (1 << 29) /* Bit 29: Trigger the host resume SE0 with HOST_FORCE_LS_SE0 = 0 or UTMI_SUSPEND=1 */
#define USBPHY_DEBUGn_SQUELCHRESETLENGTH_SHIFT            (25)      /* Bits 28-25: Duration of RESET in terms of the number of 480-MHz cycles */
#define USBPHY_DEBUGn_SQUELCHRESETLENGTH_MASK             (0xf << USBPHY_DEBUGn_SQUELCHRESETLENGTH_SHIFT)
#define USBPHY_DEBUGn_ENSQUELCHRESET                      (1 << 24) /* Bit 24: Set bit to allow squelch to reset high-speed receive */
                                                                    /* Bits 21-23: Reserved */
#define USBPHY_DEBUGn_SQUELCHRESETCOUNT_SHIFT             (16)       /* Bits 20-16: Delay in between the detection of squelch to the reset of high-speed RX */
#define USBPHY_DEBUGn_SQUELCHRESETCOUNT_MASK              (0x1f << USBPHY_DEBUGn_SQUELCHRESETCOUNT_SHIFT)
                                                                    /* Bits 13-15: Reserved */
#define USBPHY_DEBUGn_ENTX2RXCOUNT                        (1 << 12) /* Bit 12: Allow a countdown to transition in between TX and RX */
#define USBPHY_DEBUGn_TX2RXCOUNT_SHIFT                    (8)       /* Bits 11-8: Delay in between the end of transmit to the beginning of receive */
#define USBPHY_DEBUGn_TX2RXCOUNT_MASK                     (0xf << USBPHY_DEBUGn_TX2RXCOUNT_SHIFT)
                                                                    /* Bits 6-7: Reserved */
#define USBPHY_DEBUGn_ENHSTPULLDOWN_SHIFT                 (4)       /* Bits 5-4: Host pulldown overdrive mode */
#define USBPHY_DEBUGn_ENHSTPULLDOWN_MASK                  (0x3 << USBPHY_DEBUGn_ENHSTPULLDOWN_SHIFT)
#define USBPHY_DEBUGn_HSTPULLDOWN_SHIFT                   (2)       /* Bits 3-2: Connect pulldown resistors on USB_DP/USB_DM pins if pulldown overdrive mode enabled */
#define USBPHY_DEBUGn_HSTPULLDOWN_MASK                    (0x3 << USBPHY_DEBUGn_HSTPULLDOWN_SHIFT)
#define USBPHY_DEBUGn_DEBUG_INTERFACE_HOLD                (1 << 1)  /* Bit 1: Use holding registers to assist in timing for external UTMI interface */
#define USBPHY_DEBUGn_OTGIDPIOLOCK                        (1 << 0)  /* Bit 0: Hold sampled OTG ID from USBPHY_STATUS_OTGID_STATUS */

/* UTMI Debug Status Register 0 */

#define USBPHY_DEBUG0_STATUS_SQUELCH_COUNT_SHIFT            (26)    /* Bits 31-26: Running count of the squelch reset instead of normal end for HS RX */
#define USBPHY_DEBUG0_STATUS_SQUELCH_COUNT_MASK             (0x3f << USBPHY_DEBUG0_STATUS_SQUELCH_COUNT_SHIFT)
#define USBPHY_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT_SHIFT  (16)    /* Bits 25-16: Running count of the UTMI_RXERROR */
#define USBPHY_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT_MASK   (0x3ff << USBPHY_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT_SHIFT)
#define USBPHY_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT_SHIFT     (0)     /* Bits 16-0: Running count of the failed pseudo-random generator loopback */
#define USBPHY_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT_MASK      (0xffff << USBPHY_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT_SHIFT)

