apache/nuttx/arch/arm/src/kinetis/chip/kinetis_usbhs.h
/* UTMI Debug Status Register 1 */

                                                                    /* Bits 15-31: Reserved */
#define USBPHY_DEBUG1n_ENTAILADJVD_SHIFT                  (13)      /* Bits 14-13: Delay increment of the rise of squelch */
#define USBPHY_DEBUG1n_ENTAILADJVD_MASK                   (0x3 << USBPHY_DEBUG1n_ENTAILADJVD_SHIFT)
                                                                    /* Bits 0-12: Reserved */

/* UTMI RTL Version */

#define USBPHY_VERSION_MAJOR_SHIFT                        (24)       /* Bits 31-24: Fixed read-only value reflecting the MAJOR field of the RTL version */
#define USBPHY_VERSION_MAJOR_MASK                         (0xff << USBPHY_VERSION_MAJOR_SHIFT)
#define USBPHY_VERSION_MINOR_SHIFT                        (16)       /* Bits 23-16: Fixed read-only value reflecting the MINOR field of the RTL version */
#define USBPHY_VERSION_MINOR_MASK                         (0xff << USBPHY_VERSION_MINOR_SHIFT)
#define USBPHY_VERSION_STEP_SHIFT                         (0)       /* Bits 16-0: Fixed read-only value reflecting the stepping of the RTL version */
#define USBPHY_VERSION_STEP_MASK                          (0xffff << USBPHY_VERSION_STEP_SHIFT)

/* USB PHY PLL Control/Status Register */

#define USBPHY_PLL_SICn_PLL_LOCK                          (1 << 31) /* Bit 31: USB PLL lock status indicator */
                                                                    /* Bits 17-30: Reserved */
#define USBPHY_PLL_SICn_PLL_BYPASS                        (1 << 16) /* Bit 16: Bypass the USB PLL */
                                                                    /* Bits 14-15: Reserved */
#define USBPHY_PLL_SICn_PLL_ENABLE                        (1 << 13) /* Bit 13: Enable the clock output from the USB PLL */
#define USBPHY_PLL_SICn_PLL_POWER                         (1 << 12) /* Bit 12: Power up the USB PLL */
#define USBPHY_PLL_SICn_PLL_HOLD_RING_OFF                 (1 << 11) /* Bit 11: Analog debug bit */
                                                                    /* Bit 10: Reserved */
#define USBPHY_PLL_SICn_PLL_EN_USB_CLKS                   (1 << 9)  /* Bit 6: Enable the USB clock output from the USB PHY PLL */
                                                                    /* Bits 2-5: Reserved */
#define USBPHY_PLL_SICn_PLL_DIV_SEL_SHIFT                 (0)       /* Bits 5-0: Controls the USB PLL feedback loop divider */
#define USBPHY_PLL_SICn_PLL_DIV_SEL_MASK                  (0x1f << USBPHY_PLL_SICn_PLL_DIV_SEL_SHIFT)

/* USB PHY VBUS Detect Control Register */

#define USBPHY_USB1_VBUS_DETECTn_EN_CHARGER_RESISTOR      (1 << 31) /* Bit 31: Enables resistors used for an older method of resistive battery charger detection */
                                                                    /* Bits 27-30: Reserved */
#define USBPHY_USB1_VBUS_DETECTn_DISCHARGE_VBUS           (1 << 26) /* Bit 26: Controls VBUS discharge resistor */
                                                                    /* Bits 21-25: Reserved */
#define USBPHY_USB1_VBUS_DETECTn_PWRUP_CMPS               (1 << 20) /* Bit 20: Enables the VBUS_VALID comparator */
                                                                    /* Bit 19: Reserved */
#define USBPHY_USB1_VBUS_DETECTn_VBUSVALID_TO_SESSVALID   (1 << 18) /* Bit 18: Selects the comparator used for VBUS_VALID */
                                                                    /* Bits 11-17: Reserved */
#define USBPHY_USB1_VBUS_DETECTn_VBUS_SOURCE_SEL_SHIFT    (9)       /* Bits 10-9: Selects the source of the VBUS_VALID signal reported to the USB controller */
#define USBPHY_USB1_VBUS_DETECTn_VBUS_SOURCE_SEL_MASK     (0x3 << USBPHY_USB1_VBUS_DETECTn_VBUS_SOURCE_SEL_SHIFT)
#define USBPHY_USB1_VBUS_DETECTn_VBUSVALID_SEL            (1 << 8)  /* Bit 8: Selects the source of the VBUS_VALID signal reported to the USB controller */
#define USBPHY_USB1_VBUS_DETECTn_VBUSVALID_OVERRIDE       (1 << 7)  /* Bit 7: Override value for VBUS_VALID signal sent to USB controller */
#define USBPHY_USB1_VBUS_DETECTn_AVALID_OVERRIDE          (1 << 6)  /* Bit 6: Override value for A-Device Session Valid */
#define USBPHY_USB1_VBUS_DETECTn_BVALID_OVERRIDE          (1 << 5)  /* Bit 5: Override value for B-Device Session Valid */
#define USBPHY_USB1_VBUS_DETECTn_SESSEND_OVERRIDE         (1 << 4)  /* Bit 4: Override value for SESSEND */
#define USBPHY_USB1_VBUS_DETECTn_VBUS_OVERRIDE_EN         (1 << 3)  /* Bit 3: VBUS detect signal override enable */
#define USBPHY_USB1_VBUS_DETECTn_VBUSVALID_THRESH_SHIFT   (0)       /* Bits 3-0: Sets the threshold for the VBUSVALID comparator */
#define USBPHY_USB1_VBUS_DETECTn_VBUSVALID_THRESH_MASK    (0x7 << USBPHY_USB1_VBUS_DETECTn_VBUSVALID_THRESH_SHIFT)

/* USB PHY VBUS Detector Status Register */

                                                                    /* Bits 5-31: Reserved */
#define USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_3V           (1 << 4)  /* Bit 4: VBUS_VALID_3V detector status */
#define USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID              (1 << 3)  /* Bit 3: VBUS voltage status */
#define USBPHY_USB1_VBUS_DET_STAT_AVALID                  (1 << 2)  /* Bit 2: A-Device Session Valid status */
#define USBPHY_USB1_VBUS_DET_STAT_BVALID                  (1 << 1)  /* Bit 1: B-Device Session Valid status */
#define USBPHY_USB1_VBUS_DET_STAT_SESSEND                 (1 << 0)  /* Bit 0: Session End indicator */

/* USB PHY Charger Detect Status Register */

                                                                    /* Bits 5-31: Reserved */
#define USBPHY_USB1_CHRG_DET_STAT_SECDET_DCP              (1 << 4)  /* Bit 4: Battery Charging Secondary Detection phase output */
#define USBPHY_USB1_CHRG_DET_STAT_DP_STATE                (1 << 3)  /* Bit 3: Single ended receiver output for the USB_DP pin, from charger detection circuits */
#define USBPHY_USB1_CHRG_DET_STAT_DM_STATE                (1 << 2)  /* Bit 2: Single ended receiver output for the USB_DM pin, from charger detection circuits */
#define USBPHY_USB1_CHRG_DET_STAT_CHRG_DETECTED           (1 << 1)  /* Bit 1: Battery Charging Primary Detection phase output */
#define USBPHY_USB1_CHRG_DET_STAT_PLUG_CONTACT            (1 << 0)  /* Bit 0: Battery Charging Data Contact Detection phase output */

/* USB PHY Analog Control Register */

#define USBPHY_ANACTRLn_PFD_STABLE                        (1 << 31) /* Bit 31: PFD stable signal from the Phase Fractional Divider */
                                                                    /* Bits 16-30: Reserved */
#define USBPHY_ANACTRLn_EMPH_CUR_CTRL_SHIFT               (14)      /* Bits 15-14: Pre-emphasis current added for the High-Speed TX drivers */
#define USBPHY_ANACTRLn_EMPH_CUR_CTRL_MASK                (0x3 << USBPHY_ANACTRLn_EMPH_CUR_CTRL_SHIFT)
#define USBPHY_ANACTRLn_EMPH_EN                           (1 << 13) /* Bit 13: Enables pre-emphasis for the High-Speed TX drivers */
#define USBPHY_ANACTRLn_EMPH_PULSE_CTRL_SHIFT             (11)      /* Bits 12-11: Controls pre-emphasis time duration for High Speed TX drivers */
#define USBPHY_ANACTRLn_EMPH_PULSE_CTRL_MASK              (0x3 << USBPHY_ANACTRLn_EMPH_PULSE_CTRL_SHIFT)
#define USBPHY_ANACTRLn_DEV_PULLDOWN                      (1 << 10) /* Bit 10: Enable the pulldown resistors on both USB_DP and USB_DM pins */
#define USBPHY_ANACTRLn_PFD_FRAC_SHIFT                    (4)       /* Bits 9-4: PFD fractional divider used to select the pfd_clk output frequency */
#define USBPHY_ANACTRLn_PFD_FRAC_MASK                     (0x3f << USBPHY_ANACTRLn_PFD_FRAC_SHIFT)
#define USBPHY_ANACTRLn_PFD_CLK_SEL_SHIFT                 (2)       /* Bits 3-2: Selects the frequency relationship between pfd_clk output and exported USB1PFDCLK */
#define USBPHY_ANACTRLn_PFD_CLK_SEL_MASK                  (0x3 << USBPHY_ANACTRLn_PFD_CLK_SEL_SHIFT)
#define USBPHY_ANACTRLn_PFD_CLKGATE                       (1 << 1)  /* Bit 1: Clock gating (disabling) for the PFD */
#define USBPHY_ANACTRLn_TESTCLK_SEL                       (1 << 0)  /* Bit 0: Test clock selection to analog test */

/* USB PHY Loopback Control/Status Register */

